eval/results/20260407_160732_H100_80GB_HBM3_x4_Qwen2.5-1.5B-Instruct/gpu_only_bench.log
DEBUG_AG: Process 31636 importing vllm.config
DEBUG_AG: Process 31636 importing vllm.distributed
DEBUG_AG: Process 31636 importing vllm.distributed.communication_op
DEBUG_AG: Process 31636 importing vllm.distributed.parallel_state
DEBUG_AG: Process 31636 importing vllm.distributed.utils
DEBUG_AG: Process 31636 finished importing vllm.distributed.utils
DEBUG_AG: Process 31636 finished importing vllm.distributed.parallel_state
DEBUG_AG: Process 31636 importing vllm.platforms
DEBUG_AG: Process 31636 vllm.platforms import step 1 (torch)
DEBUG_AG: Process 31636 checking plugin heterogeneous
DEBUG_AG: Process 31636 checking plugin tpu
DEBUG_AG: Process 31636 checking plugin cuda
DEBUG_AG: Process 31636 finished nvmlShutdown in cuda_platform_plugin
DEBUG_AG: Process 31636 selected platform vllm.platforms.cuda.CudaPlatform
DEBUG_AG: Process 31636 importing vllm.platforms.cuda
DEBUG_AG: Process 31636 finished importing vllm.platforms.cuda
DEBUG_AG: Process 31636 finished importing vllm.distributed
DEBUG_AG: Process 31636 finished importing vllm.config
/workspace/vllm_hybrid/benchmarks/benchmark_serving.py:1298: DeprecationWarning: benchmark_serving.py is deprecated and will be removed in a future version. Please use 'vllm bench serve' instead.
  main(args)
Namespace(backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, no_stream=False, max_concurrency=None, model='Qwen/Qwen2.5-1.5B-Instruct', tokenizer=None, use_beam_search=False, num_prompts=500, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/workspace/vllm_hybrid/eval/results/20260407_160732_H100_80GB_HBM3_x4_Qwen2.5-1.5B-Instruct/gpu_only.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:16<00:00, 30.63it/s]
============ Serving Benchmark Result ============
Successful requests:                     500       
Benchmark duration (s):                  16.33     
Total input tokens:                      255169    
Total generated tokens:                  245904    
Request throughput (req/s):              30.63     
Output token throughput (tok/s):         15062.28  
Total Token throughput (tok/s):          30692.07  
---------------Time to First Token----------------
Mean TTFT (ms):                          1027.61   
Median TTFT (ms):                        1017.10   
P99 TTFT (ms):                           1556.89   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.46     
Median TPOT (ms):                        29.52     
P99 TPOT (ms):                           32.35     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.46     
Median ITL (ms):                         28.90     
P99 ITL (ms):                            52.27     
==================================================